// faq.js - файл с вопросами и ответами для FAQ
const faqData = [
    {
        question: "Как к нам попасть?",
        answer: "Никак, здесь играют только знакомые @Nerix_CM."
    },
    {
        question: "Как зарегистрироваться?",
        answer: "Зайдите на сервер, и введите «/reg <пароль> <повтор пароля>». Для авторизации введите «/login <пароль>»."
    },
    {
        question: "Как привязать аккаунт к телеграмму?",
        answer: "Откройте тг бота, нажмите «Старт», введите ник и пароль вашего аккаунта. После этого вы получите команду, ее нужно будет ввести на сервере. Для двухфакторной авторизации в боте введите «/tfon»."
    },
    {
        question: "Когда сервер включён?",
        answer: "Сервер работает с 9:00 до 00:00 МСК. Летом планируется круглосуточная работа."
    },
    {
        question: "Как получить роль больше чем «игрок»?",
        answer: "Можете подать заявку на роль «Модератор» или «Бета-тестер», у администратора @Nerix_CM. На данный момент сервер требуется только в «Бета-тестер»."
    },
    {
        question: "Как предложить свою идею для сервера?",
        answer: "Можете обратиться к администратору @Nerix_CM, рассказав от своей идеи подробно."
    }
];