// faq.js - файл с вопросами и ответами для FAQ
const faqData = [
    {
        question: "Как к нам попасть?",
        answer: "Никак, здесь играют только знакомые @Nerix_CM."
    },
    {
        question: "Как зарегистрироваться?",
        answer: "Зайдите на сервер, и введите «/reg <пароль> <повтор пароля>». Для авторизации введите «/login <пароль>»."
    },
    {
        question: "Когда сервер включён?",
        answer: "Сервер работает с 09:00 до 01:00 МСК. Летом планируется круглосуточная работа."
    },
    {
        question: "Как получить роль больше чем «игрок»?",
        answer: "Можете подать заявку на роль «Модератор» или «Бета-тестер», у администратора @Nerix_CM. На данный момент сервер требуется только в «Бета-тестер»."
    },
    {
        question: "Как предложить свою идею для сервера?",
        answer: "Можете обратиться к администратору @Nerix_CM, рассказав от своей идее подробно."
    },
    {
        question: "Какая версия?",
        answer: "Родная версия 1.21.6, но также можно зайти с 1.21.7-26.1. Позже планируется поддержка 1.21-1.21.5."
    }
];