// news.js - файл с новостями сервера (сортировка по дате: новые сверху)

const newsData = [
    {
        title: "3 сезон ванилы стартанул!",
        image: "news/vanilla_3_season.png",
        description: "Запуск третьего сезона ванилы. Переход на новую версию 1.21.6. Снова ограниченный остров, но уже больших размеров по сравнению со вторым сезоном. Состав из 9 человек, 1 из них новый но совсем старый...",
        date: "2026-04-25T09:00:00"
    },
    {
        title: "Ванильное ломание бедрока",
        image: "news/break_bedrock.png", 
        description: "Ванильный баг с ломанием бедрока, снова работает! Теперь нету никакой супер кирки, и ломать бедрок можно в каждом мире!", 
        date: "2026-05-15T16:40:00"
    },
    {
        title: "Баг с удочкой и жемчугом.",
        image: null,
        description: "Еще один полезный баг снова работает. Активируй механизм и телепортируйся на базу когда угодно!",
        date: "2026-05-17T16:00:00"
    }
];